labapart/polymcu/Device/Nordic/nRF5_SDK/components/libraries/usbd/app_usbd_core.c
    memset(p_trans_buff, 0, sizeof(uint16_t));
    if (m_descriptors.configuration->bmAttributes &
        APP_USBD_DESCRIPTOR_CONFIGURATION_ATTRIBUTE_SELF_POWERED_MASK)
    {
        SET_BIT(p_trans_buff[0], 0);
    }
    if (IS_SET(m_device_features_state, APP_USBD_SETUP_STDFEATURE_DEVICE_REMOTE_WAKEUP))
    {
        SET_BIT(p_trans_buff[0], 1);
    }
    return app_usbd_core_setup_rsp(&(p_setup_ev->setup), p_trans_buff, sizeof(uint16_t));
}

static ret_code_t setup_req_get_descriptor(app_usbd_class_inst_t const * const p_inst,
                                           app_usbd_setup_evt_t const * const p_setup_ev)
{
    switch (p_setup_ev->setup.wValue.hb)
    {
        case APP_USBD_DESCRIPTOR_DEVICE:
        {
            return app_usbd_core_setup_rsp(&(p_setup_ev->setup),
                                           &m_descriptors.device,
                                           sizeof(m_descriptors.device));
        }
        case APP_USBD_DESCRIPTOR_CONFIGURATION:
        {
            /* The size equals the size of configuration descriptor and all classes descriptors */
            size_t size = sizeof(app_usbd_descriptor_configuration_t);
            uint8_t iface_count = 0;

            /* Iterate over all registered classes count descriptors and total size */
            app_usbd_class_inst_t const * p_class;
            for (p_class = app_usbd_class_first_get(); p_class != NULL;
                 p_class = app_usbd_class_next_get(p_class))
            {
                ASSERT(NULL != (p_class->p_class_methods));
                ASSERT(NULL != (p_class->p_class_methods->get_descriptors));
                size_t dsc_size;
                const void * dsc = p_class->p_class_methods->get_descriptors(p_class, &dsc_size);
                UNUSED_VARIABLE(dsc);
                size += dsc_size;
                iface_count += app_usbd_class_iface_count_get(p_class);
            }

            m_descriptors.configuration->bNumInterfaces = iface_count;
            m_descriptors.configuration->wTotalLength = size;

            if (m_rwu_counter)
            {
                m_descriptors.configuration->bmAttributes |=
                        APP_USBD_DESCRIPTOR_CONFIGURATION_ATTRIBUTE_REMOTE_WAKEUP_MASK;
            }

            /* Access transmission buffer */
            size_t max_size;
            uint8_t * p_trans_buff = app_usbd_core_setup_transfer_buff_get(&max_size);
            /* Copy updated configuration descriptor */
            ASSERT(sizeof(m_descriptors.configuration) <= max_size);
            memcpy(p_trans_buff,
                   m_descriptors.configuration,
                   sizeof(app_usbd_descriptor_configuration_t));

            /* Fill the structure that allows iteration through all classes */
            memset(&m_descriptor_conf_feed_data, 0, sizeof(m_descriptor_conf_feed_data));

            nrf_drv_usbd_transfer_t first_tx;
            size_t tx_size = MIN(size, p_setup_ev->setup.wLength.w);
            if (tx_size > sizeof(app_usbd_descriptor_configuration_t))
            {
                p_class = app_usbd_class_first_get();
                m_descriptor_conf_feed_data.p_cinst = p_class;

                ASSERT(NULL != (p_class->p_class_methods));
                ASSERT(NULL != (p_class->p_class_methods->get_descriptors));

                m_descriptor_conf_feed_data.p_desc =
                    p_class->p_class_methods->get_descriptors(
                        p_class,
                        &(m_descriptor_conf_feed_data.desc_left));

                size_t dsc_size = sizeof(app_usbd_descriptor_configuration_t);

                m_descriptor_conf_feed_data.total_left   = tx_size      - dsc_size;
                m_descriptor_conf_feed_data.p_trans_buff = p_trans_buff + dsc_size;
                m_descriptor_conf_feed_data.max_size     = max_size     - dsc_size;

                bool tx_ready = usbd_descriptor_conf_feeder(&first_tx,
                                                            &m_descriptor_conf_feed_data);
                ASSERT(tx_ready);
                UNUSED_VARIABLE(tx_ready);

                first_tx.p_data.tx = p_trans_buff;
                first_tx.size     += sizeof(app_usbd_descriptor_configuration_t);
                ASSERT(first_tx.size <= max_size);
            }
            else
            {
                m_descriptor_conf_feed_data.p_cinst = NULL;
                m_descriptor_conf_feed_data.total_left = 0;

                first_tx.p_data.tx = p_trans_buff;
                first_tx.size      = tx_size;
            }

            /* Start first transfer */
            ret_code_t ret;
            CRITICAL_REGION_ENTER();
            ret = app_usbd_core_setup_data_transfer(NRF_DRV_USBD_EPIN0,
                                                    &first_tx,
                                                    &usbd_descriptor_feeder_desc);

            if (NRF_SUCCESS == ret)
            {
                ret = app_usbd_core_setup_data_handler_set(NRF_DRV_USBD_EPIN0,
                                                           &m_setup_data_handler_empty_desc);
            }
            CRITICAL_REGION_EXIT();

            return ret;
        }
        case APP_USBD_DESCRIPTOR_STRING:
        {
            app_usbd_string_desc_idx_t id =
                    (app_usbd_string_desc_idx_t)(p_setup_ev->setup.wValue.lb);
            uint16_t langid = p_setup_ev->setup.wIndex.w;
            uint16_t const * p_string_dsc = app_usbd_string_desc_get(id, langid);
            if (p_string_dsc == NULL)
            {
                return NRF_ERROR_NOT_SUPPORTED;
            }

            return app_usbd_core_setup_rsp(&p_setup_ev->setup,
                                           p_string_dsc,
                                           app_usbd_string_desc_length(p_string_dsc));
        }
        default:
            break;
    }


